#include "UsrDef.h"
#include "InOutComm.h"
#include "TimeTick.h"
#include "ParameterPro.h"
#include "TimeTick.h"
#include "TempSample.h"
#include "MiscFunc.h"

//#define dpad_12bit_AN002_in()   (S12AD.ADDR2)             /* AN002 K1 */
//#define dpad_12bit_AN102_in()   (S12AD1.ADDR2)            /* AN102 TP */
//#define dpad_12bit_AN206_in()   (S12AD2.ADDR6)            /* AN206 T4 */
//#define dpad_12bit_AN207_in()   (S12AD2.ADDR7)            /* AN207 T3 */
//#define dpad_12bit_AN209_in()   (S12AD2.ADDR9)            /* AN209 T6 */
//#define dpad_12bit_AN210_in()   (S12AD2.ADDR10)           /* AN210 T5 */

unsigned short u16T5_AN102Min,u16T5_AN102Max,u16T5_UsrAd_AN102;
unsigned short u16T4_AN206Min,u16T4_AN206Max,u16T4_UsrAd_AN206;
unsigned short u16T3_AN207Min,u16T3_AN207Max,u16T3_UsrAd_AN207;
unsigned short u16Tipm_AN210Min,u16Tipm_AN210Max,u16Tipm_UsrAd_AN210;
unsigned long u32T3_AdSum,u32T4_AdSum,u32T5_AdSum,u32Tipm_AdSum;
unsigned char u8AdcTim;

static unsigned char u8AdCnt;
static unsigned char u8T3ErrCnt, u8T4ErrCnt, u8T5ErrCnt, u8TipmErrCnt, u8TipmErrCnt2;
static signed short s2IPM_k2;
static signed short s2IPM_b2;
static signed short s2IPM_k1;
static signed short s2IPM_b1;

extern unsigned char const TabAD2IpmTemp[];
extern unsigned char const TabAD2Temp50K[];
extern unsigned char const TabAD2Temp5K[];

/**
  * @brief  :
  * @param  :
  * @retval :
  */
void TempSampleInit(void)
{
  u8AdCnt = 0;
  u8T3ErrCnt = 0;
  u8T4ErrCnt = 0;
  u8T5ErrCnt = 0;
  u8TipmErrCnt = 0;
  s2IPM_k2 = 0;
  s2IPM_b2 = 0;
  s2IPM_k1 = 0;
  s2IPM_b1 = 0;

  u16T5_AN102Min = 1023;
  u16T5_AN102Max = 0;
  u32T5_AdSum = 0;
  
  u16T4_AN206Min = 1023;
  u16T4_AN206Max = 0;
  u32T4_AdSum = 0;
  
  u16T3_AN207Min = 1023;
  u16T3_AN207Max = 0;
  u32T3_AdSum = 0;

  u16Tipm_AN210Min = 0;
  u16Tipm_AN210Max = 0;
  u16Tipm_UsrAd_AN210 = 0;
  
  //u2_min_ANI23 = 1023;
  //u2_max_ANI23 = 0;
  //u2_min_ANI10 = 1023;
  //u2_max_ANI10 = 0;
  //u2_min_ANI11 = 1023;
  //u2_max_ANI11 = 0;
  //ucVoltPeakAd = 0;
  //ucVoltPeak = 0;
}

/**
  * @brief  :
  * @param  :
  * @retval :
  */
void TempSampleSrv(void)
{
  signed long s32TempTmp = 0;

  if ( u8AdcTim < TIME10MS_400MS )
  {
    return;
  }
  
  u8AdcTim = 0;

  //if ( 0 == dpad2_status())  ///可能有问题,Leo
  if (1)
  {
    /* AD sample */
    //u16T5_UsrAd_AN102 = dpad_12bit_AN102_in();  // Tp ad converter
    ///u16T5_UsrAd_AN102 = dpad_12bit_AN102_in()>>4; // Tp ad converter ///原来有
    //u16T3_UsrAd_AN207 = dpad_12bit_AN207_in();  // T3 ad converter
    ///u16T3_UsrAd_AN207 = dpad_12bit_AN207_in()>>4; // T3 ad converter ///原来有
    //u16T4_UsrAd_AN206 = dpad_12bit_AN206_in();  // T4 ad converter
    ///u16T4_UsrAd_AN206 = dpad_12bit_AN206_in()>>4; // T4 ad converter ///原来有
    //u16Tipm_UsrAd_AN210 = dpad_12bit_AN210_in();// Tipm ad converter
    ///u16Tipm_UsrAd_AN210 = dpad_12bit_AN210_in()>>4;                  ///原来有
    
    //T5 AD
    u32T5_AdSum += u16T5_UsrAd_AN102;
    if ( u16T5_AN102Min > u16T5_UsrAd_AN102 )
    {
      u16T5_AN102Min = u16T5_UsrAd_AN102;
    }
    if( u16T5_AN102Max < u16T5_UsrAd_AN102 )
    {
      u16T5_AN102Max = u16T5_UsrAd_AN102;
    }
    
    //T4 AD
    u32T4_AdSum += u16T4_UsrAd_AN206;
    if ( u16T4_AN206Min > u16T4_UsrAd_AN206 )
    {
      u16T4_AN206Min = u16T4_UsrAd_AN206;
    }
    if( u16T4_AN206Max < u16T4_UsrAd_AN206 )
    {
      u16T4_AN206Max = u16T4_UsrAd_AN206;
    }

    //T3 AD
    u32T3_AdSum += u16T3_UsrAd_AN207;
    if ( u16T3_AN207Min > u16T3_UsrAd_AN207 )
    {
      u16T3_AN207Min = u16T3_UsrAd_AN207;
    }
    if( u16T3_AN207Max < u16T3_UsrAd_AN207 )
    {
      u16T3_AN207Max = u16T3_UsrAd_AN207;
    }

    //Tipm AD
    u32Tipm_AdSum += u16Tipm_UsrAd_AN210; 
    if ( u16Tipm_AN210Min > u16Tipm_UsrAd_AN210 )
    {
      u16Tipm_AN210Min = u16Tipm_UsrAd_AN210;
    }
    if( u16Tipm_AN210Max < u16Tipm_UsrAd_AN210 )
    {
      u16Tipm_AN210Max = u16Tipm_UsrAd_AN210;
    }

    //u8AdCnt++;
    if (++u8AdCnt >= SAMPLE_BUFF_NUM )
    {
      u8AdCnt = 0;
      u8T3TempAd =  (unsigned char)((u32T3_AdSum-u16T3_AN207Min-u16T3_AN207Max)>>ADCSAMPLE_FILTER); //T3 Ad
      u8T4TempAd =  (unsigned char)((u32T4_AdSum-u16T4_AN206Min-u16T4_AN206Max)>>ADCSAMPLE_FILTER); //T4 Ad
      u8T5TempAd =  (unsigned char)((u32T5_AdSum-u16T5_AN102Min-u16T5_AN102Max)>>ADCSAMPLE_FILTER); //T5 Ad
      u8IpmTempAd = (unsigned char)((u32Tipm_AdSum-u16Tipm_AN210Min-u16Tipm_AN210Max)>>ADCSAMPLE_FILTER); //Tipm Ad

      //===============================T5 temp=============================//
      if (u8T5TempAd >= 250) 
      {
        u8T5ErrCnt++;
        u8T5TempErrTim = 0;
        if (u8T5ErrCnt >= 3)
        {
          unTempErrFlgs.bits.T5Err = 1;
          unSysErrFlgs.bits.TempErr = 1;
          u8TempT5 = 0;
        }
      }
      else if (u8T5TempAd < 5)
      {
        if (u8CompSta == COMP_RUN)
        {
          if (unInSta.bits.FastTest)
          {
            if (u8T5TempErrTim >= 5)
            {
              unTempErrFlgs.bits.T5Err = 1;
              unSysErrFlgs.bits.TempErr = 1;
            }
          }
          else
          {
            if (u8T5TempErrTim >= 120)
            {
              u8T5ErrCnt++;
              if (u8T5ErrCnt >= 3)
              {
                unTempErrFlgs.bits.T5Err = 1;
                unSysErrFlgs.bits.TempErr = 1;
              }
            }
          }
        }
        else
        {
          u8T5ErrCnt = 0;
          u8T5TempErrTim = 0;
        }
      }
      else
      {
        u8T5ErrCnt = 0;
        u8T5TempErrTim = 0;
        if ( unInSta.bits.SelfChk )
        {
          if ((u8T5TempAd < 125)||(u8T5TempAd > 129))
          {
            unTempErrFlgs.bits.T5Err = 1;
            unSysErrFlgs.bits.TempErr = 1;
          }
        }
        else if (unTempErrFlgs.bits.T5Err)
        {
          if(u8TempErrHold >= ERR_RST_TIM)
          {
            unTempErrFlgs.bits.T5Err = 0;
            if (0 == unTempErrFlgs.u8Byte)
            {
              unSysErrFlgs.bits.TempErr = 0;
            }
          }
        }
        else
        {
          u8TempT5 = TabAD2Temp50K[u8T5TempAd];
        }
      }

      u32T5_AdSum = 0;
      u16T5_AN102Min = 1023;
      u16T5_AN102Max = 0;

      //===============================T3 temp=============================//
      if (u8T3TempAd <= 5 || u8T3TempAd >= 250)
      {
        u8T3ErrCnt++;
        if (u8T3ErrCnt >= 3)
        {
          unTempErrFlgs.bits.T3Err = 1;
          unSysErrFlgs.bits.TempErr = 1;
        }
      }
      else
      {
        u8T3ErrCnt = 0;
        if ( unInSta.bits.SelfChk )
        {
          if ((u8T3TempAd < 73)||(u8T3TempAd > 80))
          {
            unTempErrFlgs.bits.T3Err = 1;
            unSysErrFlgs.bits.TempErr = 1;
          }
        }
        else if ( unTempErrFlgs.bits.T3Err )
        {
          if(u8TempErrHold >= ERR_RST_TIM) //传感报警解除后30s才能恢复
          {
            unTempErrFlgs.bits.T3Err = 0;
            if (0 == unTempErrFlgs.u8Byte)
            {
              unSysErrFlgs.bits.TempErr = 0;
            }
          }
        }
        else
        {
          u8TempT3 = TabAD2Temp5K[u8T3TempAd];
        }
      }

      u32T3_AdSum = 0;
      u16T3_AN207Min = 1023;
      u16T3_AN207Max = 0;

      //=======================================T4 temp====================================//
      if (u8T4TempAd <= 5 || u8T4TempAd >= 250)
      {
        u8T4ErrCnt++;
        if (u8T4ErrCnt >= 3)
        {
          unTempErrFlgs.bits.T4Err = 1;
          unSysErrFlgs.bits.TempErr = 1;
          u8TempT4 = 0;
        }
      }
      else
      {
        u8T4ErrCnt = 0;
        if ( unInSta.bits.SelfChk )
        {
          if ((u8T4TempAd < 73)||(u8T4TempAd > 80))
          {
            unTempErrFlgs.bits.T4Err = 1;
            unSysErrFlgs.bits.TempErr = 1;
          }
        }
        else if ( unTempErrFlgs.bits.T4Err )
        {
          if(u8TempErrHold >= ERR_RST_TIM) //传感报警解除后30s才能恢复
          {
            unTempErrFlgs.bits.T4Err = 0;
            if (0 == unTempErrFlgs.u8Byte)
            {
              unSysErrFlgs.bits.TempErr = 0;
            }
          }
        }
        else
        {
          u8TempT4 = TabAD2Temp5K[u8T4TempAd];
        }
      }
      
      u32T4_AdSum = 0;
      u16T4_AN206Min = 1023;
      u16T4_AN206Max = 0;

      //=======================================IPM temp====================================//
      //IPM temp
      if (u8IpmTempAd >= 250)
      {
        u8TipmErrCnt++;
        if (u8TipmErrCnt >= 3)
        {
          unSysErrFlgs.bits.TempErr = 1;
          unTempErrFlgs.bits.TipmErr = 1;
        }
      }
      else if ((u8IpmTempAd < 5) && (unInSta.bits.FastTest))
      {
        u8TipmErrCnt++;
        if (u8TipmErrCnt >= 3)
        {
          unSysErrFlgs.bits.TempErr = 1;
          unTempErrFlgs.bits.TipmErr = 1;
        }
      }
      else
      {
        u8TipmErrCnt = 0;
        u8IpmTempk1k2Ad = u8IpmTempAd;
        if(unTempErrFlgs.bits.TipmErr)
        {
          if(u8TempErrHold >= ERR_RST_TIM) //传感报警解除后30s才能恢复
          {
            unTempErrFlgs.bits.TipmErr = 0;
            if (0 == unTempErrFlgs.u8Byte)
            {
              unSysErrFlgs.bits.TempErr = 0;
            }
          }
        }
      }

      //k1k2
      if(s2IPM_k1 < 0)
      {
        // - k AD值大于时走上线
        if (U8_IPM_CHANGE_TEMP_AD <= u8IpmTempk1k2Ad )
        {
          s32TempTmp = (((signed long)s16IPM_k1 * (signed long)u8IpmTempk1k2Ad) >> 8) + (signed long)s16IPM_b1;
        }
        else
        {
          s32TempTmp = (((signed long)s16IPM_k2 * (signed long)u8IpmTempk1k2Ad) >> 8) + (signed long)s16IPM_b2;
        }
      }
      else
      {
        if (u8IpmTempk1k2Ad <= U8_IPM_CHANGE_TEMP_AD)           // + k
        {
          s32TempTmp = (((signed long)s16IPM_k1 * (signed long)u8IpmTempk1k2Ad) >> 8) + (signed long)s16IPM_b1;
        }
        else
        {
          s32TempTmp = (((signed long)s16IPM_k2 * (signed long)u8IpmTempk1k2Ad) >> 8) + (signed long)s16IPM_b2;
        }
      }
      if (s32TempTmp <= 50)
      {
        u8TempIpm = 50;
      }
      else if(s32TempTmp >= 210)
      {
        u8TempIpm = 210;
      }
      else
      {
        u8TempIpm = (unsigned char)s32TempTmp;//IPM模块温度
      }

      //IPM over temp
      if(u8TempIpm >= (100*2))                //100度报警停机
      {
        u8TipmErrCnt2 ++;
        if(u8TipmErrCnt2 >= 20)               //约10*100ms*8 = 8s,其中100ms是调用周期
        {
          u8TipmErrCnt2 = 20;
          fgIPMProt = 1;
        }
      }
      else if(u8TempIpm < (80 * 2))           //80度恢复
      {
        u8TipmErrCnt2 = 0;
        if(u8TempErrHold >= ERR_RST_TIM)
        {
          fgIPMProt = 0;
        }
      }
      else
      {
        u8TipmErrCnt2 = 0;
      }

      u32Tipm_AdSum = 0;
      u16Tipm_AN210Min = 1023;
      u16Tipm_AN210Max = 0;
    }
  }
  
  //error
  if(fgErrT1)
  {
    u8TempT1 = TEMP_MACRO(25);
  }
  else if (unInitFlgs.bits.TempAD)
  {
    u8TempT1 = TabAD2Temp5K[u8T1TempAd];
  }

  if(fgErrT2)
  {
    u8TempT2 = TEMP_MACRO(25);
  }
  else if (unInitFlgs.bits.TempAD)
  {
    u8TempT2 = TabAD2Temp5K[u8T2TempAd];
  }

  if(fgErrT2b)
  {
    u8TempT2b = TEMP_MACRO(25);
  }
  else if (unInitFlgs.bits.TempAD)
  {
    u8TempT2b = TabAD2Temp5K[u8T2bTempAd];
  }

  if(unTempErrFlgs.bits.T4Err || unTempErrFlgs.bits.T5Err)  //排气故障,T4只影响T4限频
  {
    if(u8InSetMode == C_ModeHeat)
    {
      u8TempT4 = TEMP_MACRO(15);
    }
    else if(u8InSetMode != C_ModeOff)
    {
      u8TempT4 = TEMP_MACRO(50);
    }
  }
}

unsigned char const TabAD2Temp5K[] =
{
  //;AD绝对值  实际温度  对应阻值
  0,          //0
  0,          //1
  0,          //2
  0,          //3
  0,          //4
  0,          //5
  0,          //6
  0,          //7
  0,          //8
  0,          //9
  0,          //10
  0,          //11
  0,          //12
  0,          //13
  0,          //14
  0,          //15
  0,          //16  -30
  0,          //17  -30
  0,          //18  -30
  2,          //19  -29
  4,          //20  -28
  6,          //21  -27
  8,          //22  -26
  10,         //23  -25
  11,         //24  -24.5
  13,         //25  -23.5
  15,         //26  -22.5
  17,         //27  -21.5
  18,         //28  -21
  20,         //29  -20
  22,         //30  -19
  23,         //31  -18.5
  25,         //32  -17.5
  26,         //33  -17
  28,         //34  -16
  29,         //35  -15.5
  0+30,       //36  -15   25.66
  1+30,       //37
  2+30,       //38  -14   24.52
  3+30,       //39
  4+30,       //40  -13   23.43
  6+30,       //41  -12   22.39
  7+30,       //42
  8+30,       //43  -11   21.41
  10+30,       //44  -10   20.48
  11+30,       //45
  12+30,       //46  -9    19.59
  13+30,       //47
  14+30,       //48  -8    18.74
  15+30,       //49
  16+30,       //50  -7    17.93
  18+30,       //51  -6    17.16
  19+30,       //52
  20+30,       //53  -5    16.431
  21+30,       //54
  22+30,       //55  -4    15.739
  23+30,       //56
  24+30,       //57  -3    15.08
  25+30,       //58
  26+30,       //59  -2    14.454
  27+30,       //60
  28+30,       //61  -1    13.857
  29+30,       //62
  30+30,       //63  0   13.29
  31+30,       //64
  32+30,       //65  1   12.739
  33+30,       //66
  34+30,       //67  2   12.215
  35+30,       //68
  36+30,       //69  3   11.717
  37+30,       //70
  38+30,       //71  4   11.241
  39+30,       //72
  40+30,       //73  5   10.789
  41+30,       //74
  42+30,       //75  6   10.357
  43+30,       //76
  44+30,       //77  7   9.946
  45+30,       //78
  45+30,       //79
  46+30,       //80  8   9.554
  47+30,       //81
  48+30,       //82  9   9.18
  49+30,       //83
  50+30,       //84  10    8.823
  51+30,       //85
  52+30,       //86  11    8.482
  53+30,       //87
  54+30,       //88  12    8.157
  55+30,       //89
  55+30,       //90
  56+30,       //91  13    7.846
  57+30,       //92
  58+30,       //93  14    7.55
  59+30,       //94
  60+30,       //95  15    7.266
  61+30,       //96
  62+30,       //97  16    6.991
  63+30,       //98
  63+30,       //99
  64+30,       //100 17    6.729
  65+30,       //101
  66+30,       //102 18    6.478
  67+30,       //103
  68+30,       //104 19    6.238
  69+30,       //105
  69+30,       //106
  70+30,       //107 20    6.008
  71+30,       //108
  72+30,       //109 21    5.789
  73+30,       //110
  74+30,       //111 22    5.578
  75+30,       //112
  75+30,       //113
  76+30,       //114 23    5.377
  77+30,       //115
  78+30,       //116 24    5.185
  79+30,       //117
  80+30,       //118 25    5
  81+30,       //119
  81+30,       //120
  82+30,       //121 26    4.821
  83+30,       //122
  84+30,       //123 27    4.649
  85+30,       //124
  86+30,       //125 28    4.485
  87+30,       //126
  87+30,       //127
  88+30,       //128 29    4.327
  89+30,       //129
  90+30,       //130 30    4.176
  91+30,       //131
  92+30,       //132 31    4.031
  93+30,       //133
  94+30,       //134 32    3.892
  95+30,       //135
  95+30,       //136
  96+30,       //137 33    3.759
  97+30,       //138
  98+30,       //139 34    3.631
  99+30,       //140
  100+30,       //141 35    3.508
  101+30,       //142
  102+30,       //143 36    3.389
  103+30,       //144
  104+30,       //145 37    3.275
  105+30,       //146
  106+30,       //147 38    3.165
  107+30,       //148
  107+30,       //149
  108+30,       //150 39    3.06
  109+30,       //151
  110+30,       //152 40    2.959
  111+30,       //153
  112+30,       //154 41    2.861
  113+30,       //155
  114+30,       //156 42    2.768
  115+30,       //157
  116+30,       //158 43    2.678
  117+30,       //159
  118+30,       //160 44    2.592
  119+30,       //161
  120+30,       //162 45    2.509
  121+30,       //163
  122+30,       //164 46    2.429
  124+30,       //165 47    2.352
  125+30,       //166
  126+30,       //167 48    2.278
  127+30,       //168
  128+30,       //169 49    2.207
  129+30,       //170
  130+30,       //171 50    2.138
  131+30,       //172
  132+30,       //173 51    2.071
  133+30,       //174
  134+30,       //175 52    2.006
  136+30,       //176 53    1.944
  137+30,       //177
  138+30,       //178 54    1.884
  139+30,       //179
  140+30,       //180 55    1.826
  142+30,       //181 56    1.77
  143+30,       //182
  144+30,       //183 57    1.717
  145+30,       //184
  146+30,       //185 58    1.665
  148+30,       //186 59    1.615
  149+30,       //187
  150+30,       //188 60    1.567
  152+30,       //189 61    1.521
  153+30,       //190
  154+30,       //191 62    1.476
  156+30,       //192 63    1.433
  158+30,       //193 64    1.391
  159+30,       //194
  160+30,       //195 65    1.351
  162+30,       //196 66    1.312
  164+30,       //197 67    1.274
  165+30,       //198
  166+30,       //199 68    1.237
  168+30,       //200 69    1.202
  170+30,       //201 70    1.168
  171+30,       //202 70.5
  173+30,       //203 71.5
  174+30,       //204 72
  176+30,       //205 73
  178+30,       //206 74
  180+30,       //207 75
  182+30,       //208 76
  183+30,       //209 76.5
  185+30,       //210 77.5
  187+30,       //211 78.5
  189+30,       //212 79.5
  190+30,       //213 80
  190+30,       //214
  190+30,       //215
  190+30,       //216
  190+30,       //217
  190+30,       //218
  190+30,       //219
  190+30,       //220
  190+30,       //221
  190+30,       //222
  190+30,       //223
  190+30,       //224
  190+30,       //225
  190+30,       //226
  190+30,       //227
  190+30,       //228
  190+30,       //229
  190+30,       //230
  190+30,       //231
  190+30,       //232
  190+30,       //233
  190+30,       //234
  190+30,       //235
  190+30,       //236
  190+30,       //237
  190+30,       //238
  190+30,       //239
  190+30,       //240
  190+30,       //241
  190+30,       //242
  190+30,       //243
  190+30,       //244
  190+30,       //245
  190+30,       //246
  190+30,       //247
  190+30,       //248
  190+30,       //249
  190+30,       //250
  190+30,       //251
  190+30,       //252
  190+30,       //253
  190+30,       //254
  190+30,       //255
};

unsigned char const TabAD2Temp50K[] =
{
  //; AD绝对值  实际温度  对应阻值
  0,        //0
  0,        //1
  0,        //2
  0,        //3
  0,        //4
  0,        //5
  0,        //6
  0,        //7
  0,        //8
  0,        //9
  0,        //10
  0,        //11
  0,        //12
  0,        //13
  0,        //14
  0,        //15  163.45
  2,        //16  147.66
  3,        //17  140.41
  4,        //18  133.56
  5,        //19  127.09
  7,        //20  115.17
  8,        //21  109.69
  9,        //22  104.5
  10,       //23  99.58
  11,       //24  94.93
  12,       //25  90.52
  13,       //26  86.33
  13,       //27
  14,       //28  82.37
  15,       //29  78.61
  16,       //30  75.04
  17,       //31  71.65
  17,       //32
  18,       //33  68.44
  19,       //34  65.34
  20,       //35  62.48
  20,       //36
  21,       //37  59.73
  22,       //38  57.11
  23,       //39  54.62
  23,       //40
  24,       //41  52.25
  24,       //42
  25,       //43  50
  26,       //44  47.86
  26,       //45
  27,       //46  45.82
  28,       //47  43.88
  28,       //48
  29,       //49  42.03
  29,       //50
  30,       //51  40.26
  31,       //52  38.59
  31,       //53
  32,       //54  36.99
  32,       //55
  33,       //56  35.46
  33,       //57
  34,       //58  34.01
  34,       //59
  35,       //60  32.62
  35,       //61
  36,       //62  31.3
  36,       //63
  37,       //64  30.04
  37,       //65
  38,       //66  28.83
  38,       //67
  39,       //68  27.68
  39,       //69
  40,       //70  26.58
  40,       //71
  41,       //72  25.53
  41,       //73
  42,       //74  24.53
  42,       //75
  43,       //76  23.57
  43,       //77
  44,       //78  22.66
  44,       //79
  45,       //80  21.78
  45,       //81
  46,       //82  20.94
  46,       //83
  46,       //84
  47,       //85  20.14
  47,       //86
  48,       //87  19.38
  48,       //88
  49,       //89  18.64
  49,       //90
  50,       //91  17.94
  50,       //92
  50,       //93
  51,       //94  17.27
  51,       //95
  52,       //96  16.62
  52,       //97
  53,       //98  16.01
  53,       //99
  54,       //100 15.42
  54,       //101
  54,       //102
  55,       //103 14.85
  55,       //104
  56,       //105 14.31
  56,       //106
  57,       //107 13.79
  57,       //108
  58,       //109 13.29
  58,       //110
  58,       //111
  59,       //112 12.82
  59,       //113
  60,       //114 12.36
  60,       //115
  61,       //116 11.92
  61,       //117
  61,       //118
  62,       //119 11.5
  62,       //120
  63,       //121 11.1
  63,       //122
  64,       //123 10.71
  64,       //124
  65,       //125 10.34
  65,       //126
  65,       //127
  66,       //128 9.98
  66,       //129
  67,       //130 9.64
  67,       //131
  68,       //132 9.31
  68,       //133
  69,       //134 8.99
  69,       //135
  69,       //136
  70,       //137 8.68
  70,       //138
  71,       //139 8.39
  71,       //140
  72,       //141 8.11
  72,       //142
  73,       //143 7.84
  73,       //144
  74,       //145 7.58
  74,       //146
  75,       //147 7.38
  75,       //148
  76,       //149 7.09
  76,       //150
  77,       //151 6.86
  77,       //152
  78,       //153 6.64
  78,       //154
  79,       //155 6.42
  79,       //156
  80,       //157 6.21
  80,       //158
  81,       //159 6.02
  81,       //160
  82,       //161 5.82
  82,       //162
  83,       //163 5.64
  83,       //164
  84,       //165 5.46
  84,       //166
  85,       //167 5.29
  85,       //168
  86,       //169 5.13
  87,       //170 4.97
  87,       //171
  88,       //172 4.81
  88,       //173
  89,       //174 4.67
  89,       //175
  90,       //176  4.52
  91,       //177  4.38
  91,       //178
  92,       //179  4.25
  92,       //180
  93,       //181  4.12
  94,       //182  4
  94,       //183
  95,       //184  3.88
  96,       //185  3.77
  96,       //186
  97,       //187  3.65
  98,       //188  3.55
  98,       //189
  99,       //190  3.44
  100,        //191  3.34
  101,        //192  3.25
  101,        //193
  102,        //194  3.15
  103,        //195  3.06
  103,        //196
  104,        //197  2.97
  105,        //198  2.89
  106,        //199  2.81
  107,        //200  2.73
  107,        //201
  108,        //202  2.65
  109,        //203  2.58
  110,        //204  2.5
  111,        //205  2.44
  112,        //206  2.37
  113,        //207  2.3
  114,        //208  2.24
  115,        //209  2.18
  116,        //210  2.12
  117,        //211  2.06
  118,        //212  2.01
  119,        //213  1.95
  120,        //214  1.9
  121,        //215  1.85
  122,        //216  1.8
  123,        //217  1.76
  124,        //218  1.71
  125,        //219  1.67
  125,        //220
  125,        //221
  125,        //222
  125,        //223
  125,        //224
  125,        //225
  125,        //226
  125,        //227
  125,        //228
  125,        //229
  125,        //230
  125,        //231
  125,        //232
  125,        //233
  125,        //234
  125,        //235
  125,        //236
  125,        //237
  125,        //238
  125,        //239
  125,        //240
  125,        //241
  125,        //242
  125,        //243
  125,        //244
  125,        //245
  125,        //246
  125,        //247
  125,        //248
  125,        //249
  125,        //250
  125,        //251
  125,        //252
  125,        //253
  125,        //254
  125,        //255
};

unsigned char const TabAD2IpmTemp[] =
{
  0,      //0
  0,      //1
  0,      //2
  114,    //3
  114,    //4
  114,    //5
  114,    //6
  114,    //7
  114,    //8
  114,    //9
  114,    //10
  114,    //11
  114,    //12
  114,    //13
  114,    //14
  114,    //15
  114,    //16
  114,    //17
  114,    //18
  114,    //19
  114,    //20
  114,    //21
  114,    //22
  114,    //23
  114,    //24
  114,    //25
  114,    //26
  114,    //27
  114,    //28
  114,    //29
  114,    //30
  114,    //31
  114,    //32
  114,    //33
  114,    //34
  114,    //35
  114,    //36
  114,    //37
  114,    //38
  114,    //39
  114,    //40
  114,    //41
  114,    //42
  114,    //43
  114,    //44
  114,    //45
  114,    //46
  114,    //47
  114,    //48
  114,    //49
  114,    //50
  115,    //51
  117,    //52
  119,    //53
  120,    //54
  122,    //55
  123,    //56
  124,    //57
  126,    //58
  127,    //59
  129,    //60
  130,    //61
  131,    //62
  132,    //63
  134,    //64
  135,    //65
  137,    //66
  138,    //67
  140,    //68
  141,    //69
  142,    //70
  142,    //71
  145,    //72
  146,    //73
  148,    //74
  149,    //75
  150,    //76
  151,    //77
  153,    //78
  154,    //79
  156,    //80
  157,    //81
  158,    //82
  159,    //83
  161,    //84
  162,    //85
  163,    //86
  164,    //87
  165,    //88
  166,    //89
  168,    //90
  169,    //91
  170,    //92
  171,    //93
  172,    //94
  173,    //95
  175,    //96
  176,    //97
  177,    //98
  178,    //99
  179,    //100
  180,    //101
  181,    //102
  182,    //103
  183,    //104
  184,    //105
  185,    //106
  186,    //107
  187,    //108
  188,    //109
  189,    //110
  190,    //111
  191,    //112
  192,    //113
  193,    //114
  194,    //115
  195,    //116
  195,    //117
  196,    //118
  197,    //119
  198,    //120
  199,    //121
  200,    //122
  200,    //123
  201,    //124
  202,    //125
  203,    //126
  203,    //127
  204,    //128
  205,    //129
  206,    //130
  206,    //131
  207,    //132
  207,    //133
  208,    //134
  209,    //135
  210,    //136
  210,    //137
  211,    //138
  211,    //139
  212,    //140
  212,    //141
  213,    //142
  214,    //143
  215,    //144
  215,    //145
  216,    //146
  216,    //147
  217,    //148
  217,    //149
  218,    //150
  218,    //151
  219,    //152
  219,    //153
  220,    //154
  220,    //155
  221,    //156
  221,    //157
  222,    //158
  222,    //159
  223,    //160
  223,    //161
  224,    //162
  224,    //163
  225,    //164
  225,    //165
  226,    //166
  226,    //167
  226,    //168
  226,    //169
  227,    //170
  227,    //171
  228,    //172
  228,    //173
  229,    //174
  229,    //175
  230,    //176
  230,    //177
  230,    //178
  230,    //179
  231,    //180
  231,    //181
  232,    //182
  232,    //183
  232,    //184
  232,    //185
  233,    //186
  233,    //187
  233,    //188
  233,    //189
  234,    //190
  234,    //191
  235,    //192
  235,    //193
  235,    //194
  236,    //195
  236,    //196
  236,    //197
  236,    //198
  236,    //199
  237,    //200
  237,    //201
  237,    //202
  237,    //203
  238,    //204
  238,    //205
  238,    //206
  238,    //207
  238,    //208
  239,    //209
  239,    //210
  239,    //211
  239,    //212
  239,    //213
  239,    //214
  239,    //215
  239,    //216
  239,    //217
  239,    //218
  239,    //219
  239,    //220
  239,    //221
  239,    //222
  239,    //223
  239,    //224
  239,    //225
  239,    //226
  239,    //227
  239,    //228
  239,    //229
  239,    //230
  239,    //231
  239,    //232
  239,    //233
  239,    //234
  239,    //235
  239,    //236
  239,    //237
  239,    //238
  239,    //239
  239,    //240
  239,    //241
  239,    //242
  239,    //243
  239,    //244
  239,    //245
  239,    //246
  239,    //247
  239,    //248
  239,    //249
  239,    //250
  239,    //251
  239,    //252
  239,    //253
  239,    //254
  239,    //255
};

